---
kind: other
id: Properties.T:Autodesk.Revit.DB.ModelArc
source: html/d5b4a028-3318-9159-7718-54134f25c2aa.htm
---
# ModelArc Properties

The id of the assembly instance to which the element belongs.